Revit 2024 API
IFCAggregateIterator.CurrentObject Property
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
internal Object CurrentObject { get; }
Visual Basic
Friend ReadOnly Property CurrentObject As Object
	Get
Visual C++
internal:
virtual property Object^ CurrentObject {
	Object^ get () sealed;
}
Implements
IEnumerator.Current
See Also
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace